In [1]:
import pandas as pd

In [4]:
#I read my exported table from Dbeaver
df_csv = pd.read_csv('./../data/diamonds.csv')

In [5]:
# I prepare a table to visualise top 3 cities and lowest 3 cities
df_top_cities= df_csv[['Price', 'City']]

In [6]:
df2 = df_top_cities.groupby('City').sum()
df2= df2.sort_values(by=['Price'])
df2

                  Price
City
Tel Aviv        9403135
London          9735671
Paris           9882819
Amsterdam       9894647
Zurich         10039535
Luxembourg     10041655
Madrid         10103241
Las Vegas      10135050
New York City  10157646
Dubai          10210177
Antwerp        19391713
Kimberly       19806237
Surat          20123695

In [7]:
df_low3= df2.head(3)
df_top3= df2.tail(3)

In [9]:
df_low3.to_csv('./../data/low3.csv')
df_top3.to_csv('./../data/top3.csv')

In [11]:
# I prepare another talbe to group clarity by categories
df_csv = pd.read_csv('./../data/diamantitos.csv')
df_clarity= df_csv[['Price', 'Clarity','City']]

In [12]:
df_clarity.replace('IF', '0-Internaly Flawless', inplace=True)
df_clarity.replace('VVS1', '1-Very very slightly included', inplace=True)
df_clarity.replace('VVS2', '1-Very very slightly included', inplace=True)
df_clarity.replace('VS1', '2-Very slightly included', inplace=True)
df_clarity.replace('VS2', '2-Very slightly included', inplace=True)
df_clarity.replace('SI1', '3-Slightly included', inplace=True)
df_clarity.replace('SI2', '3-Slightly included', inplace=True)
df_clarity.replace('I1', '4-Included', inplace=True)
df_clarity.replace('I2', '4-Included', inplace=True)

/Users/Izaskun/miniconda3/envs/diamonds/lib/python3.7/site-packages/pandas/core/frame.py:5244: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  method=method,

In [13]:
df_clarity

       Price                   Clarity       City
0       4268  2-Very slightly included      Dubai
1        505  2-Very slightly included   Kimberly
2       2686  2-Very slightly included  Las Vegas
3        738       3-Slightly included   Kimberly
4       4882       3-Slightly included      Dubai
...      ...                       ...        ...
40450  10070  2-Very slightly included    Antwerp
40451  12615       3-Slightly included     Madrid
40452   5457       3-Slightly included   Kimberly
40453    456  2-Very slightly included   Kimberly
40454   6232       3-Slightly included     London

[40455 rows x 3 columns]

In [14]:
df_clarity.to_csv('./../data/clarity.csv')